0Bu/tesla-key-esp32/main/ota_update.cpp
static OtaStatusPod initial_status() noexcept {
    OtaStatusPod status{};
    copy_status_text(status.message, "idle");
    return status;
}

static std::atomic<SemaphoreHandle_t> s_lock{nullptr};
static OtaStatusPod                   s_status = initial_status();
static std::atomic<bool>              s_running{false};    // a check or download task is active
static std::atomic<unsigned>          s_target_pr{0};      // target PR for current check/update session

static SemaphoreHandle_t ensure_lock() {
    SemaphoreHandle_t lock = s_lock.load(std::memory_order_acquire);
    if (lock) return lock;

    SemaphoreHandle_t candidate = xSemaphoreCreateMutex();
    if (!candidate) return nullptr;
    if (!s_lock.compare_exchange_strong(lock, candidate,
                                        std::memory_order_release,
                                        std::memory_order_acquire)) {
        vSemaphoreDelete(candidate);
        return lock;
    }
    return candidate;
}

static void set_state(OtaState st, int pct, const char* msg) {
    std::array<char, kOtaStatusMessageCapacity> message{};
    copy_status_text(message, msg);
    SemaphoreHandle_t lock = ensure_lock();
    if (!lock) return;
    tk::SemGuard g(lock);
    if (!g) return;
    s_status.state     = st;
    s_status.progress  = pct;
    s_status.target_pr = s_target_pr.load(std::memory_order_relaxed);
    s_status.message   = message;
}

static OtaStatus unavailable_status_snapshot() {
    // This object is built independently of s_status. It may still throw if the standard library
    // cannot represent even these short strings under total OOM (callers already contain that),
    // but it can never race a writer or copy a concurrently-reallocated std::string buffer.
    return {OtaState::Error, 0, "unavailable", "", false, ""};
}

OtaStatus ota_get_status() {
    SemaphoreHandle_t lock = ensure_lock();
    if (!lock) return unavailable_status_snapshot();
    OtaStatusPod snapshot{};
    {
        tk::SemGuard g(lock);
        if (!g) return unavailable_status_snapshot();
        snapshot = s_status;  // fixed POD/arrays only; noexcept and cross-generation coherent
    }
    // Any allocation happens after releasing the status lock. A failed materialization is caught
    // by the HTTP/task boundary and cannot leave a partially published shared generation.
    return {snapshot.state, snapshot.progress, snapshot.message.data(),
            snapshot.available.data(), snapshot.update_available, snapshot.current.data(),
            snapshot.target_pr};
}

bool ota_is_busy() {
    return s_running.load(std::memory_order_acquire) ||
           s_operation_gate.state() ==
               tk::OtaIdentityGateState::Ota;
}

// ─── Canonical, bounded version input ──────────────────────────────────────────

static std::string_view running_version() {
    const esp_app_desc_t* description = esp_app_get_description();
    return description ? tk::bounded_c_string_view(description->version) : std::string_view{};
}

static void publish_check_status(const OtaStatusPod& candidate) noexcept {
    SemaphoreHandle_t lock = ensure_lock();
    if (!lock) return;
    tk::SemGuard g(lock);
    if (!g) return;
    s_status = candidate;
}

static void set_check_error(const char* message) noexcept {
    OtaStatusPod candidate{};
    candidate.state = OtaState::Error;
    copy_status_text(candidate.message, message);
    const std::string_view current = running_version();
    copy_status_text(candidate.current, current.data());
    publish_check_status(candidate);
}

// ─── Small HTTPS GET into a buffer (for the tiny manifest.json) ─────────────────

static bool http_get_to_buffer(const char* url, std::string& out) {
    out.clear();
    esp_http_client_config_t cfg = {};
    cfg.url               = url;
    cfg.crt_bundle_attach = esp_crt_bundle_attach;   // verify against bundled CA roots
    cfg.timeout_ms        = 10000;

    esp_http_client_handle_t c = esp_http_client_init(&cfg);
    if (!c) return false;
    struct HttpClientGuard {
        esp_http_client_handle_t handle;
        ~HttpClientGuard() {
            esp_http_client_close(handle);
            esp_http_client_cleanup(handle);
        }
    } client_guard{c};

    if (esp_http_client_open(c, 0) == ESP_OK) {
        const std::int64_t content_length = esp_http_client_fetch_headers(c);
        const int status = esp_http_client_get_status_code(c);
        if (status == 200) {
            const bool chunked = esp_http_client_is_chunked_response(c);
            tk::BoundedHttpBodyGate body_gate(content_length, chunked);
            if (!body_gate.valid_headers()) {
                ESP_LOGW(TAG, "manifest length is missing, empty or exceeds %u bytes",
                         static_cast<unsigned>(tk::kOtaManifestMaxBytes));
                return false;
            }

            // One exact bounded allocation: repeated append growth can transiently require both
            // the old and new contiguous blocks while TLS is still live. Fixed-length responses
            // reserve their declared size; chunked responses reserve the hard 8192-byte ceiling.
            try {
                out.reserve(chunked ? tk::kOtaManifestMaxBytes
                                    : static_cast<std::size_t>(content_length));
            } catch (...) {
                ESP_LOGW(TAG, "manifest buffer allocation failed");
                return false;
            }

            char buf[512];
            while (true) {
                const std::size_t requested = body_gate.next_read_size(sizeof(buf));
                if (requested == 0) {
                    out.clear();
                    return false;
                }
                const int read = esp_http_client_read(c, buf, static_cast<int>(requested));
                const auto decision = body_gate.accept_read(
                    read, esp_http_client_is_complete_data_received(c));
                if (decision == tk::BoundedBodyReadResult::Reject) {
                    ESP_LOGW(TAG, "manifest response was truncated, oversized or read failed");
                    out.clear();
                    return false;
                }
                if (read > 0) out.append(buf, static_cast<std::size_t>(read));
                if (decision == tk::BoundedBodyReadResult::Complete) return true;
            }
        } else {
            ESP_LOGW(TAG, "manifest HTTP status %d", status);
        }
    } else {
        ESP_LOGW(TAG, "manifest connection failed");
    }

    out.clear();
    return false;
}

