0Bu/tesla-key-esp32/main/ota_update.cpp
// ─── Check for a newer release ──────────────────────────────────────────────────

[[gnu::noinline]] static const char* resolve_manifest_url_into(unsigned pr_number, std::string& out) {
    if (pr_number > 0) {
        char buf[80];
        if (tk::format_pr_manifest_url(pr_number, buf, sizeof(buf))) {
            out = buf;
            return out.c_str();
        }
    }
    return CONFIG_TESLA_OTA_MANIFEST_URL;
}

OtaCheckResult ota_check(unsigned pr_number) {
    OtaCheckResult res{};
    res.target_pr = pr_number;
    res.current = running_version();

    const char* manifest_url = resolve_manifest_url_into(pr_number, res.reason);
    ESP_LOGI(TAG, "checking %s (running %s)", manifest_url, res.current.c_str());

    std::string body;
    if (!http_get_to_buffer(manifest_url, body)) {
        res.ok     = false;
        res.reason = "could not reach update server";
        return res;
    }

    const char* parse_end = nullptr;
    const auto materialized = tk::json_materialize<cJSON>(
        body.data(), body.size(), [&](const char* text) {
            return cJSON_ParseWithLengthOpts(
                text, body.size() + 1, &parse_end, true);
        });
    if (materialized.status != tk::JsonMaterializeStatus::Ok) {
        res.ok     = false;
        res.reason = materialized.status == tk::JsonMaterializeStatus::NoMemory
                         ? "update manifest ran out of resources"
                         : "invalid update manifest";
        return res;
    }
    std::unique_ptr<cJSON, decltype(&cJSON_Delete)> j(materialized.root, cJSON_Delete);
    const tk::OtaManifestVersion manifest = tk::inspect_ota_manifest(j.get());
    if (parse_end != body.c_str() + body.size() ||
        manifest.status != tk::OtaManifestInspectStatus::Valid || !manifest.value) {
        res.ok     = false;
        res.reason = "invalid update manifest";
        return res;
    }
    // cJSON owns decoded strings. Release the bounded transport body before any result-string
    // allocation so the largest-block peak is body+cJSON, never body+cJSON+another body-sized copy.
    std::string{}.swap(body);
    const std::string_view available(manifest.value);
    // Validate the cJSON-owned view before copying: an attacker-controlled ~8 KiB version must
    // not trigger another large contiguous std::string allocation while TLS/body/cJSON coexist.
    if (!tk::canonical_ota_version(available)) {
        res.ok     = false;
        res.reason = "invalid version in manifest";
        return res;
    }
    if (!tk::canonical_ota_version(res.current)) {
        res.ok     = false;
        res.reason = "invalid running firmware version";
        return res;
    }
    res.available.assign(available.data(), available.size());

    res.ok               = true;
    res.update_available = tk::is_ota_update_available(res.available, res.current, pr_number);
    res.reason           = res.update_available ? "update available" : "up to date";
    ESP_LOGI(TAG, "available %s — %s", res.available.c_str(), res.reason.c_str());
    return res;
}

// Publish a finished check into the shared status for /ota/status polling.
static void set_check_done(const OtaCheckResult& r) {
    OtaStatusPod candidate{};
    candidate.state = r.ok ? OtaState::Idle : OtaState::Error;
    candidate.progress = 0;
    candidate.update_available = r.update_available;
    candidate.target_pr = r.target_pr;
    copy_status_text(candidate.message, r.reason.c_str());
    copy_status_text(candidate.available, r.available.c_str());
    copy_status_text(candidate.current, r.current.c_str());
    publish_check_status(candidate);
}

static void ota_check_task(void*) {
    try {
        // A one-shot job: contain any throw (http_get_to_buffer's std::string appends, cJSON, the
        // result std::string ops can all bad_alloc) as a terminal Error state — NEVER let it unwind
        // into the FreeRTOS C trampoline and reboot the device mid-check (issue #204).
        try {
            const unsigned pr = s_target_pr.load(std::memory_order_acquire);
            OtaCheckResult r = ota_check(pr);   // blocking HTTPS GET, runs off the HTTP task
            set_check_done(r);
        } catch (const std::exception& e) {
            ESP_LOGE(TAG, "OTA check task exception: %s", e.what());
            set_check_error("update check ran out of resources");
        } catch (...) {
            ESP_LOGE(TAG, "OTA check task unknown exception");
            set_check_error("update check failed unexpectedly");
        }
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        vTaskDelete(nullptr);
    } catch (...) {
        // The outer boundary also contains any future throwing setup/cleanup statement added
        // around the operation-specific handler above.
        ESP_LOGE(TAG, "OTA check boundary cleanup threw; stopping task");
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        vTaskDelete(nullptr);
    }
}

bool ota_check_start(unsigned pr_number) {
    if (!ensure_lock()) return false;
    // Acquire the cross-domain gate before publishing/starting the worker. This atomically loses
    // to an in-flight key/VIN transaction instead of sampling a separate busy flag and racing it.
    if (!try_begin_ota_operation()) return false;
    if (s_running.exchange(true, std::memory_order_acq_rel)) {
        finish_operation(tk::OtaIdentityGateState::Ota);
        return false;
    }
    s_target_pr.store(pr_number, std::memory_order_release);
    try {
        set_state(OtaState::Checking, 0, pr_number > 0 ? "checking for PR preview" : "checking for updates");
    } catch (...) {
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        return false;
    }

    // mbedTLS handshake + manifest fetch run here; same generous stack as ota_task.
    if (xTaskCreate(ota_check_task, "ota_chk", 8192, nullptr, tk::kPrioOtaCheck, nullptr) != pdPASS) {
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        set_check_error("could not start check task");
        return false;
    }
    return true;
}

// ─── Background download + install ──────────────────────────────────────────────

[[gnu::noinline]] static std::string resolve_firmware_url(unsigned target_pr) {
    if (target_pr > 0) {
        char buf[96];
        if (tk::format_pr_firmware_url(target_pr, TESLA_OTA_IMG_SUFFIX, buf, sizeof(buf))) {
            return std::string(buf);
        }
    }
    return std::string(CONFIG_TESLA_OTA_FIRMWARE_BASE_URL "tesla-key-esp32" TESLA_OTA_IMG_SUFFIX ".bin");
}

